const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "Obot",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "🔰𝐒𝐑𝐀𝐁𝐎𝐍🔰",
  description: "goibot",
  commandCategory: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
};

module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Dhaka").format("HH:MM:ss L");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = [
    "তুমি মিয়া ফাজিল একটা খালি bot bot করো 😡😒", 
    "শুনবো না😼তুমি আমার (শ্রাবণ) বসকে প্রেম করাই দাও নাই🥺পচা তুমি🥺", 
    "আমি আবাল দের সাথে কথা বলি না,ok😒", 
    "এতো ডেকো না,প্রেম এ পরে যাবো তো🙈", 
    "Bolo Babu, তুমি কি আমাকে ভালোবাসো? 🙈💋", 
    "বার বার ডাকলে মাথা গরম হয়ে যায় কিন্তু😑", 
    "হ্যা বলো😒, তোমার জন্য কি করতে পারি😐😑?", 
    "এতো ডাকছিস কেন?গালি শুনবি নাকি? 🤬", 
    "I love you janu🥰", 
    "আরে Bolo আমার জান ,কেমন আছো?😚", 
    "অসম্মান করছিস😰😿", 
    "Hop beda😾 Boss বল boss😼", 
    "চুপ থাক নাই তো তোর দাত ভেগে দিবো কিন্তু", 
    "আরেকবার বট বললে ওইটা কেটে ছোট বানিয়ে দিবো🤭🤫", 
    "বট বলে চলে যাস কেন😤🥺কী হলো উওর দে🥺", 
    "জানু বল জানু 😘", 
    "বার বার Disturb করছিস কোনো😾,আমার জানুর সাথে ব্যাস্ত আছি😋", 
    "বোকাচোদা এতো ডাকিস কেন🤬", 
    "আমাকে ডাকলে ,আমি কিন্তু কিস করে দিবো😘", 
    "আমারে এতো ডাকিস না আমি মজা করার mood এ নাই এখন😒", 
    "চিপায় আছি ডিস্টার্ব করিস না🙊🙁", 
    "হ্যাঁ জানু , এইদিক এ আসো কিস দেই🤭 😘", 
    "দূরে যা, তোর কোনো কাজ নাই, শুধু bot bot করিস 😉😋🤣", 
    "তোর কথা তোর বাড়ি কেউ শুনে না ,তো আমি কোনো শুনবো ?🤔😂", 
    "আমাকে ডেকো না,আমি ব্যাস্ত আছি", 
    "কি হলো , মিস্টেক করচ্ছিস নাকি🤣", 
    "বলো কি বলবা, সবার সামনে বলবা নাকি?🤭🤏", 
    "কালকে দেখা করিস তো একটু 😈", 
    "হা বলো, শুনছি আমি 😏", 
    "আর কত বার ডাকবি ,শুনছি তো", 
    "হুম বলো কি বলবে😒", 
    "উফ্ খেলার সময়ও ডাকা-ডাকি করে 😑🌚🔞", 
    "বলো কি করতে পারি তোমার জন্য", 
    "আমি তো অন্ধ কিছু দেখি না🐸 😎", 
    "শ্রাবণ বস তোমাকে ভালোবাসে😌", 
    "বলো জানু 🌚", 
    "তোর কি চোখে পড়ে না আমি শ্রাবণ জানুর সাথে ব্যাস্ত আছি😒", 
    "হুম জান তোমার ওই খানে উম্মাহ😑😘", 
    "আহ শুনা আমার তোমার অলিতে গলিতে উম্মাহ😇😘", 
    "jang hanga korba😒😬", 
    "হুম জান তোমার অইখানে উম্মম্মাহ😷😘", 
    "আসসালামু আলাইকুম বলেন আপনার জন্য কি করতে পারি..!🥰", 
    "আমাকে এতো না ডেকে বস শ্রাবণ এর কে একটা গার্লফ্রেন্ড দে 🙄", 
    "আমাকে এতো ডাকো কেন?🤔 ভলো-টালো বাসো নাকি🤭🙈", 
    "🌻🌺💚আসসালামু আলাইকুম ওয়া রাহমাতুল্লাহ-💚🌺🌻", 
    "আমি এখন বস শ্রাবণ এর সাথে বিজি আছি আমাকে ডাকবেন না-😕😏 ধন্যবাদ-🤝🌻", 
    "আমাকে না ডেকে আমার বস শ্রাবণকে কে একটা জি এফ দাও-😽🫶🌺", 
    "জান🥺 তুমি এখন শুধু বট বলে চলে যাও 😒 ভুলে গেলা নাকি🙂❓", 
    "উফফ বুঝলাম না এতো ডাকছেন কেনো-😤😡😈", 
    "জান তোমার নানি'রে আমার হাতে তুলে দিবা-🙊🙆‍♂️", 
    "আজকে আমার মন ভালো নেই তাই আমারে ডাকবেন না-😪🤧", 
    "আমি তোমাকে রাতে রাতে ভালোবাসি উম্মম্মাহ-🌺🤤💦", 
    "চুনা ও চুনা আমার বস শ্রাবণ এর হবু বউ রে কেও দেকছো খুজে পাচ্ছি না😪🤧😭", 
    "স্বপ্ন তোমারে নিয়ে দেখতে চাই তুমি যদি আমার হয়ে থেকে যাও-💝🌺🌻", 
    "জান হাঙ্গা করবা-🙊😝🌻", 
    "জান মেয়ে হলে চিপায় আসো ইউটিউব থেকে অনেক ভালোবাসা শিখছি তোমার জন্য-🙊🙈😽", 
    "ইসস এতো ডাকো কেনো লজ্জা লাগে তো-🙈🖤🌼", 
    "আমার বস শ্রাবণ এর পক্ষ থেকে তোমারে এতো এতো ভালোবাসা-🥰😽🫶 আমার বস শ্রাবণের জন্য সবাই দোয়া করবেন-💝১০টা বিয়ে যেন করতে পারে🤭🤫", 
    "ভালোবাসা নামক আব্লামি করতে মন চাইলে আমার বস (Srabon) এর ইনবক্স চলে যাও-🙊🥱👅 🌻𝐅𝐀𝐂𝐄𝐁𝐎𝐎𝐊 𝐈𝐃 𝐋𝐈𝐍𝐊 🌻:- m.me/CyberJod444", 
    "জান তুমি শুধু আমার আমি তোমারে ৩৬৫ দিন ভালোবাসি-💝🌺😽", 
    "জান বাল ফালাইবা-🙂🥱🙆‍♂", 
    "আন্টি-🙆-আপনার মেয়ে-👰‍♀️-রাতে আমারে ভিদু কল দিতে বলে🫣-🥵🤤💦", 
    "oii-🥺🥹-এক🥄 চামচ ভালোবাসা দিবা-🤏🏻🙂", 
    "আপনার সুন্দরী বান্ধুবীকে ফিতরা হিসেবে আমার বস শ্রাবণ কে দান করেন-🥱🐰🍒", 
    "ও মিম ও মিম-😇-তুমি কেন চুরি করলা সাদিয়ার ফর্সা হওয়ার ক্রীম-🌚🤧", 
    "অনুমতি দিলাম-𝙋𝙧𝙤𝙥𝙤𝙨𝙚 কর Srabon বস কে-🐸😾🔪", 
    "𝙂𝙖𝙮𝙚𝙨-🤗-যৌবনের কসম দিয়ে আমারে 𝐁𝐥𝐚𝐜𝐤𝐦𝐚𝐢𝐥 করা হচ্ছে-🥲🤦‍♂️🤧", 
    "-𝗢𝗶𝗶 আন্টি-🙆‍♂️-তোমার মেয়ে চোখ মারে-🥺🥴🐸", 
    "তাকাই আছো কেন চুমু দিবা-🙄🐸😘", 
    "আজকে প্রপোজ করে দেখো রাজি হইয়া যামু-😌🤗😇", 
    "আমার গল্পে তোমার নানি সেরা-🙊🙆‍♂️🤗", 
    "কি বেপার আপনি শ্বশুর বাড়িতে যাচ্ছেন না কেন-🤔🥱🌻", 
    "দিনশেষে পরের 𝐁𝐎𝐖 সুন্দর-☹️🤧", 
    "তাবিজ কইরা হইলেও প্রেম এক্কান করমুই তাতে যা হই হোক-🤧🥱🌻", 
    "ছোটবেলা ভাবতাম বিয়ে করলে অটোমেটিক বাচ্চা হয়-🥱-ওমা এখন দেখি কাহিনী অন্যরকম-😦🙂🌻", 
    "আজ একটা বিন নেই বলে ফেসবুকের নাগিন-🤧-গুলোরে আমার বস Srabon ধরতে পারছে না-🐸🥲", 
    "চুমু থাকতে তোরা বিড়ি খাস কেন বুঝা আমারে-😑😒🐸⚒️", 
    "যে ছেড়ে গেছে-😔-তাকে ভুলে যাও-🙂 \n আমার বস Srabon এর সাথে প্রেম করে তাকে দেখিয়ে দাও-🙈🐸🤗", 
    "হাজারো লুচ্চা লুচ্চির ভিরে-🙊🥵আমার বস Srabon এক নিস্পাপ ভালো মানুষ-🥱🤗🙆‍♂️", 
    "রূপের অহংকার করো না-🙂❤️চকচকে সূর্যটাও দিনশেষে অন্ধকারে পরিণত হয়-🤗💜", 
    "সুন্দর মাইয়া মানেই-🥱আমার বস boss Srabon এর বউ-😽🫶আর বাকি গুলো আমার বেয়াইন-🙈🐸🤗", 
    "এত অহংকার করে লাভ নেই-🌸মৃত্যুটা নিশ্চিত শুধু সময়টা অ'নিশ্চিত-🖤🙂", 
    "দিন দিন কিছু মানুষের কাছে অপ্রিয় হয়ে যাইতেছি-🙂😿🌸", 
    "হুদাই আপনারে শয়তানে লারে-😝😑☹️", 
    "𝗜 𝗟𝗢𝗩𝗢 𝗬𝗢𝗨-😽-আহারে ভাবছো তোমারে প্রোপজ করছি-🥴-থাপ্পর দিয়া কিডনী লক করে দিব-😒-ভুল পড়া বের করে দিবো-🤭🐸", 
    "আমি একটা দুধের শিশু-😇-🫵𝗬𝗢𝗨🐸💦", 
    "কতদিন হয়ে গেলো বিছনায় মুতি না-😿-মিস ইউ নেংটা কাল-🥺🤧", 
    "বালিকা━👸-𝐃𝐨 𝐲𝐨𝐮-🫵-বিয়া-𝐦𝐞-😽-আমি তোমাকে-😻-আম্মু হইতে সাহায্য করব-🙈🥱", 
    "এই আন্টির মেয়ে-🫢🙈-𝐔𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐚𝐡-😽🫶-আসলেই তো স্বাদ-🥵💦এতো স্বাদ কেন-🤔-সেই স্বাদ-😋", 
    "ইস কেউ যদি বলতো-🙂-আমার শুধু তোমাকেই লাগবে-💜🌸", 
    "ওই বেডি তোমার বাসায় না আমার বস শ্রাবণ মেয়ে দেখতে গেছিলো-🙃-নাস্তা আনারস আর দুধ দিছো-🙄🤦‍♂️-আরে বইন কইলেই তো হতো বয়ফ্রেন্ড আছে-🥺🤦‍♂-আমার বস শ্রাবণ-কে জানে মারার কি দরকার ছিলো🙄🤧", 
    "একদিন সে ঠিকই ফিরে তাকাবে-😇-আর মুচকি হেসে বলবে তোমার boss Srabon এর মতো আর কেউ ভালবাসেনি-🙂😅", 
    "হুদাই গ্রুপে আছি-🥺🐸-কেও ইনবক্সে নক দিয়ে বলে না জান তোমারে আমি অনেক ভালোবাসি-🥺🤧", 
    "কি'রে গ্রুপে দেখি একটাও বেডি নাই-🤦‍🥱💦", 
    "দেশের সব কিছুই চুরি হচ্ছে-🙄-শুধু আমার বস শ্রাবণ এর মনটা ছাড়া-🥴😑😏", 
    "🫵তোমারে প্রচুর ভাল্লাগে-😽-সময় মতো প্রপোজ করমু বুঝছো-🔨😼-ছিট খালি রাইখো- 🥱🐸🥵", 
    "আজ থেকে আর কাউকে পাত্তা দিমু না -!😏-কারণ আমি ফর্সা হওয়ার ক্রিম কিনছি -!🙂🐸", 
    "মেয়ে হলে বস শ্রাবণ এর সাথে প্রেম করো🙈??.", 
    "অসম্মান করচ্ছিছ কেন,😰😿", 
    "আমি গরীব এর সাথে কথা বলি না😼😼", 
    "মাইয়া হলে আমার বস শ্রাবণ কে Ummmmha দে 😒", 
    "আম পাতা জোড়া-জোড়া মারবো চাবুক তোমার পাছায়🫩🐸😌", 
    "༊━━🦋নামাজি মানুষেরা সব থেকে বেশি সুন্দর হয়..!!😇🥀 🦋 কারণ.!! -অজুর পানির মত শ্রেষ্ঠ মেকআপ দুনিয়াতে নেই༊━ღ━༎🥰🥀 🥰-আলহামদুলিল্লাহ-🥰", 
    " দুনিয়ার সবাই প্রেম করে.!🤧 -আর মানুষ আমার বস শ্রাবণ কে সন্দেহ করে.!🐸", 
    "থাপ্পড় চিনোস থাপ্পড়- 👋👋😡 -চিন্তা করিস না তরে মারমু না-🤗 -বস শ্রাবণ আমারে মারছে - 🥱 - উফফ সেই স্বাদ..!🥵🤤💦", 
    "যেই আইডির মায়ায় পড়ে ভুল্লি আমারে.!🥴- তুই কি যানিস সেই আইডিটাও আমি চালাইরে.!🙂"
  ];
  var rand = tl[Math.floor(Math.random() * tl.length)]

  if (event.body.toLowerCase() == "miss you") {
    return api.sendMessage("<আমি তোমাকে রাইতে মিস খাই🥹🤖👅/👅-✘ 🎀 🍒:))", threadID);
  };

  if (event.body.toLowerCase() == "sim" || event.body.toLowerCase() == "simsimi") {
    return api.sendMessage("simsimi কমান্ড এড় নাই টাইপ করুন baby", threadID);
  };

  if (event.body.toLowerCase() == "bc" || event.body.toLowerCase() == "mc") {
    return api.sendMessage("SAME TO YOU😊", threadID);
  };

  if (event.body.toLowerCase() == "🫦" || event.body.toLowerCase() == "💋") {
    return api.sendMessage("কিরে হালা লুচ্চা, এগুলো কি ইমুজি দেস ।", threadID);
  };

  if (event.body.toLowerCase() == "morning") {
    return api.sendMessage("GOOD MORNING দাত ব্রাশ করে খেয়ে নেও😚", threadID);
  };

  if (event.body.toLowerCase() == "srabon" || event.body.toLowerCase() == "Srabon") {
    return api.sendMessage("সত্যি কথা বলো🤬\nতুমি কী বসকে ভালোবাসো??", threadID);
  };

  if (event.body.toLowerCase() == "শ্রাবণ" || event.body.toLowerCase() == "সরাবন" || event.body.toLowerCase() == "@Srabon") {
    return api.sendMessage("উনি এখন কাজে বিজি আছে কি বলবেন আমাকে বলতে পারেন..!😘", threadID);
  };

  if (event.body.toLowerCase() == "owner" || event.body.toLowerCase() == "ceo") {
    return api.sendMessage("[𝐎𝐖𝐍𝐄𝐑:☞ Srabon", threadID);
  };

  if (event.body.toLowerCase() == "tor boss ke" || event.body.toLowerCase() == "admin ke") {
    return api.sendMessage("My Creator: Srabon", threadID);
  };

  if (event.body.toLowerCase() == "admin" || event.body.toLowerCase() == "boter admin") {
    return api.sendMessage("He is Srabonッ❤️ তাকে সবাই শ্রাবণ নামে চিনে🤙", threadID);
  };

  if (event.body.toLowerCase() == "assalamu alaikum" || event.body.toLowerCase() == "আসসালামু আলাইকুম" || event.body.toLowerCase() == "salam") {
    return api.sendMessage("️- ওয়ালাইকুমুস-সালাম-!!🖤", threadID);
  };

  if (event.body.toLowerCase() == "sala ami tor boss" || event.body.toLowerCase() == "ami srabon") {
    return api.sendMessage("সরি বস মাফ করে দেন আর এমন ভুল হবে না🥺🙏", threadID);
  };

  if (event.body.toLowerCase() == "kiss me") {
    return api.sendMessage("️ তুমি পঁচা তোমাকে কিস দিবো না 🤭", threadID);
  };

  if (event.body.toLowerCase() == "tnx" || event.body.toLowerCase() == "ধন্যবাদ" || event.body.toLowerCase() == "thanks") {
    return api.sendMessage("️এতো ধন্যবাদ না দিয়ে শ্রাবণ বস এর জন্য একটা গার্লফ্রেন্ড খুজে দে🤬🌶️", threadID);
  };

  if (event.body.toLowerCase() == "name" || event.body.toLowerCase() == "tor nam ki") {
    return api.sendMessage("️MY NAME IS °_>🔰𝗦𝗿𝗮𝗯𝗼𝗻_𝗕𝗼𝘁🔰", threadID);
  };

  if (event.body.toLowerCase() == "gf" || event.body.toLowerCase() == "bf") {
    return api.sendMessage("খালি কি তোরাই পেম করবি আমাকেও একটা গার্লফ্রেন্ড দে<🥺", threadID);
  };

  if (event.body.toLowerCase() == "how are you" || event.body.toLowerCase() == "kemon acho") {
    return api.sendMessage("আমি তখনই ভালো থাকি যখন আপনাকে হাসতে দেখি🤎☺️", threadID);
  };

  if (event.body.toLowerCase() == "fuck" || event.body.toLowerCase() == "fuck you") {
    return api.sendMessage("সব মুতার জায়গায় গুঁতা দেওয়ার ধান্দা 😪🥱", threadID);
  };

  if (event.body.toLowerCase() == "bye" || event.body.toLowerCase() == "বাই") {
    return api.sendMessage("কিরে তুই কই যাস কোন মেয়ের সাথে চিপায় যাবি..!🌚🌶️🍆⛏️", threadID);
  };

  if (event.body.toLowerCase() == "ami srabon") {
    return api.sendMessage("হ্যা বস কেমন আছেন..?☺️", threadID);
  };

  if (event.body.indexOf("/Bot") == 0 || event.body.indexOf("/bot") == 0) {
    var msg = {
      body: `${name}, ${rand}`
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
